schedule.org
#+options: toc:nil
* Schedule DSC 101 Fall 2021

   | No | DATE   | LECTURES                        | ASSIGNMENTS                 | Project / Test               |
   |----+--------+---------------------------------+-----------------------------+------------------------------|
   |  1 | 17-Aug | Course overview                 |                             |                              |
   |  2 | 19-Aug | Course overview                 |                             |                              |
   |  3 | 24-Aug | Data Science overview           |                             |                              |
   |  4 | 26-Aug | Data Science overview           | Intro to Basics             |                              |
   |  5 | 31-Aug | Installing R / Shell            |                             |                              |
   |  6 | 2-Sep  | Getting started with R          | Vectors                     |                              |
   |  7 | 7-Sep  | Arithmetic with R               |                             |                              |
   |  8 | 9-Sep  | Arithmetic with R               |                             | 1st sprint review            |
   |  9 | 14-Sep | Work on Projects                |                             |                              |
   | 10 | 16-Sep | Data structures in R            | Matrices                    |                              |
   | 11 | 21-Sep | Data structures in R            |                             |                              |
   | 12 | 23-Sep | CANCELLED (Day of Renewal)      | Factors                     |                              |
   | 13 | 28-Sep | Data structures in R            |                             |                              |
   | 14 | 30-Sep | MIDTERM EXAM                    |                             | Test: Midterm exam           |
   | 15 | 7-Oct  | PRESENTATIONS                   | Data frames                 | 2nd sprint review            |
   | 16 | 12-Oct | Exam review                     |                             |                              |
   | 17 | 14-Oct | Literate Programming            | Importing data              | Notebook: data structures    |
   | 18 | 19-Oct | Data input/output               |                             | Notebook: Data import        |
   | 19 | 21-Oct | Base R graphics                 | Intro to ~plot()~           | Test: vectorization/litprog  |
   | 20 | 26-Oct | Base R graphics                 |                             | Notebook: base graphics      |
   | 21 | 28-Oct | Different plot types            | Different plot types        | Notebook: plot types         |
   | 22 | 2-Nov  | +PRESENTATIONS+                 |                             | 3rd sprint review            |
   | 23 | 4-Nov  | Adding deatils to plots         | Adding details to plots     |                              |
   | 24 | 9-Nov  | Grammar of graphics (~ggplot2~) |                             | Test: grammar of graphics    |
   | 25 | 11-Nov | Managing visual complexity      | How much is too much        | Notebook: visualization      |
   | 26 | 16-Nov | Managing visual complexity      |                             |                              |
   | 27 | 18-Nov | Advanced plot customization     | Advanced plot customization | Notebook: plot customization |
   | 28 | 23-Nov | Advanced plot customization     |                             | Test: plotting               |
   | 29 | 30-Nov | Team presentations              |                             | 4th sprint review            |
   | 30 | 2-Dec  | Team presentations              |                             | 4th sprint review            |

