schedule.md


# Schedule DSC 101 Fall 2021

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">No</th>
<th scope="col" class="org-left">DATE</th>
<th scope="col" class="org-left">LECTURES</th>
<th scope="col" class="org-left">ASSIGNMENTS</th>
<th scope="col" class="org-left">Project / Test</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">17-Aug</td>
<td class="org-left">Course overview</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">2</td>
<td class="org-left">19-Aug</td>
<td class="org-left">Course overview</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">3</td>
<td class="org-left">24-Aug</td>
<td class="org-left">Data Science overview</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">4</td>
<td class="org-left">26-Aug</td>
<td class="org-left">Data Science overview</td>
<td class="org-left">Intro to Basics</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">5</td>
<td class="org-left">31-Aug</td>
<td class="org-left">Installing R / Shell</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">6</td>
<td class="org-left">2-Sep</td>
<td class="org-left">Getting started with R</td>
<td class="org-left">Vectors</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">7</td>
<td class="org-left">7-Sep</td>
<td class="org-left">Arithmetic with R</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">8</td>
<td class="org-left">9-Sep</td>
<td class="org-left">Arithmetic with R</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1st sprint review</td>
</tr>


<tr>
<td class="org-right">9</td>
<td class="org-left">14-Sep</td>
<td class="org-left">Work on Projects</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">10</td>
<td class="org-left">16-Sep</td>
<td class="org-left">Data structures in R</td>
<td class="org-left">Matrices</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">11</td>
<td class="org-left">21-Sep</td>
<td class="org-left">Data structures in R</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">12</td>
<td class="org-left">23-Sep</td>
<td class="org-left">CANCELLED (Day of Renewal)</td>
<td class="org-left">Factors</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">13</td>
<td class="org-left">28-Sep</td>
<td class="org-left">Data structures in R</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">14</td>
<td class="org-left">30-Sep</td>
<td class="org-left">MIDTERM EXAM</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Test: Midterm exam</td>
</tr>


<tr>
<td class="org-right">15</td>
<td class="org-left">7-Oct</td>
<td class="org-left">PRESENTATIONS</td>
<td class="org-left">Data frames</td>
<td class="org-left">2nd sprint review</td>
</tr>


<tr>
<td class="org-right">16</td>
<td class="org-left">12-Oct</td>
<td class="org-left">Exam review</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">17</td>
<td class="org-left">14-Oct</td>
<td class="org-left">Literate Programming</td>
<td class="org-left">Importing data</td>
<td class="org-left">Notebook: data structures</td>
</tr>


<tr>
<td class="org-right">18</td>
<td class="org-left">19-Oct</td>
<td class="org-left">Data input/output</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Notebook: Data import</td>
</tr>


<tr>
<td class="org-right">19</td>
<td class="org-left">21-Oct</td>
<td class="org-left">Base R graphics</td>
<td class="org-left">Intro to <code>plot()</code></td>
<td class="org-left">Test: vectorization/litprog</td>
</tr>


<tr>
<td class="org-right">20</td>
<td class="org-left">26-Oct</td>
<td class="org-left">Base R graphics</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Notebook: base graphics</td>
</tr>


<tr>
<td class="org-right">21</td>
<td class="org-left">28-Oct</td>
<td class="org-left">Different plot types</td>
<td class="org-left">Different plot types</td>
<td class="org-left">Notebook: plot types</td>
</tr>


<tr>
<td class="org-right">22</td>
<td class="org-left">2-Nov</td>
<td class="org-left"><del>PRESENTATIONS</del></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3rd sprint review</td>
</tr>


<tr>
<td class="org-right">23</td>
<td class="org-left">4-Nov</td>
<td class="org-left">Adding deatils to plots</td>
<td class="org-left">Adding details to plots</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">24</td>
<td class="org-left">9-Nov</td>
<td class="org-left">Grammar of graphics (<code>ggplot2</code>)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Test: grammar of graphics</td>
</tr>


<tr>
<td class="org-right">25</td>
<td class="org-left">11-Nov</td>
<td class="org-left">Managing visual complexity</td>
<td class="org-left">How much is too much</td>
<td class="org-left">Notebook: visualization</td>
</tr>


<tr>
<td class="org-right">26</td>
<td class="org-left">16-Nov</td>
<td class="org-left">Managing visual complexity</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">27</td>
<td class="org-left">18-Nov</td>
<td class="org-left">Advanced plot customization</td>
<td class="org-left">Advanced plot customization</td>
<td class="org-left">Notebook: plot customization</td>
</tr>


<tr>
<td class="org-right">28</td>
<td class="org-left">23-Nov</td>
<td class="org-left">Advanced plot customization</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Test: plotting</td>
</tr>


<tr>
<td class="org-right">29</td>
<td class="org-left">30-Nov</td>
<td class="org-left">Team presentations</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">4th sprint review</td>
</tr>


<tr>
<td class="org-right">30</td>
<td class="org-left">2-Dec</td>
<td class="org-left">Team presentations</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">4th sprint review</td>
</tr>
</tbody>
</table>

